---
kind: property
id: P:Autodesk.Revit.DB.Segment.SizeCount
source: html/37ecbc0e-2e6b-ca9a-cddd-4a46641ee2db.htm
---
# Autodesk.Revit.DB.Segment.SizeCount Property

The number of size objects in the segment.

## Syntax (C#)
```csharp
public int SizeCount { get; }
```